My dataset represents the number of students admitted to Ohio University from 2000-2019, broken down by gender. I found it on guthub here: https://github.com/nicoledinan/bythenumbers/blob/master/reference/data.xlsx
This is my raw dataset, spread throughout different sheets: https://docs.google.com/spreadsheets/d/16gfL7LCbo9-JSje6s8Xz6_HoONhVHlQbRu9eMfQI-Uk/edit?usp=sharing
my Tidied dataset is the first sheet of that group of sheets. The data I found initially was organized by major, so I ended up having to transpose and re-organize the data based on year, then used the sum function to add up students in each college by gender and year. I found that, although admissions numbers grew steadily, they started to drop after a peak in 2015. The university projects admissions and enrollment to continue to drop for a few years to come.

In [1]:
import pandas as pd

In [7]:
df = pd.read_csv('Ohio University Admissions by Year - Sheet1.csv')

In [8]:
df.head(5)

   Year  Students Admitted  Male  Female
0  2000               3661  1572    2089
1  2001               3223  1532    2246
2  2002               3703  1595    2108
3  2003               3672  1594    2078
4  2004               3795  1712    2083

In [10]:
df.shape

(20, 4)

In [11]:
df = pd.read_csv('Ohio University Admissions by Year Raw - Sheet2.csv')

In [12]:
df.head(5)

  Arts & Sciences Unnamed: 1 Unnamed: 2  Unnamed: 3
0            Year       Male     Female         NaN
1            2000        318        533       851.0
2            2001        315        570       330.0
3            2002        325        535       860.0
4            2003        330        576       906.0

In [13]:
df.shape

(242, 4)